using System;
using System.Collections;
using System.Collections.Generic;

namespace HandyMan.Types
{
    public class KeyDictionaries
    {
        public static readonly Dictionary<char, char> CirillycLatinKeys = new Dictionary<char, char>
        {
            {'a' , 'а' },            {'A' , 'А' },
            {'b' , 'б' },            {'B' , 'Б' },
            {'c' , 'с' },            {'C' , 'С' },
            {'d' , 'д' },            {'D' , 'Д' },
            {'e' , 'э' },            {'E' , 'Э' },
            {'f' , 'ф' },            {'F' , 'Ф' },
            {'g' , 'г' },            {'G' , 'Г' },
            {'h' , 'х' },            {'H' , 'Х' },
            {'i' , 'и' },            {'I' , 'И' },
            {'j' , 'й' },            {'J' , 'Й' },
            {'k' , 'к' },            {'K' , 'К' },
            {'l' , 'л' },            {'L' , 'Л' },
            {'m' , 'м' },            {'M' , 'М' },
            {'n' , 'н' },            {'N' , 'Н' },
            {'o' , 'о' },            {'O' , 'О' },
            {'p' , 'п' },            {'P' , 'П' },
            {'q' , 'ж' },            {'Q' , 'Ж' },
            {'r' , 'р' },            {'R' , 'Р' },
            {'s' , 'ш' },            {'S' , 'Ш' },
            {'t' , 'т' },            {'T' , 'Т' },
            {'u' , 'у' },            {'U' , 'У' },
            {'v' , 'в' },            {'V' , 'В' },
            {'w' , 'щ' },            {'W' , 'Щ' },
            {'x' , 'ь' },            {'y' , 'ъ' },
            {'z' , 'з' },            {'Z' , 'З' },
            {'á' , 'я' },            {'Á' , 'Я' },
            {'é' , 'е' },            {'É' , 'Е' },
            {'ó' , 'ё' },            {'Ó' , 'Ё' },
            {'ú' , 'ю' },            {'Ú' , 'Ю' },
            {'í' , 'ы' },            {'Í' , 'Ы' },
            {'ö' , 'ч' },            {'Ö' , 'Ч' },
            {'ü' , 'ц' },            {'Ü' , 'Ц' }            
        };

    }
}